{
  "projects": [
    {
      "title": "Casumo",
      "subtitle": "2022 - Casumo - React.js",
      "href": "casumo",
      "stack": "react",
      "link": "https://casumo.com/",
      "description": "An online casino built with great care for their customers.",
      "roleTitle": "Senior React.js developer",
      "role": [
        "My role was to handle multiple small bugs in authorization and authentication as well as migrating knockout.js app to React. The architecture is really complex and it required seniorty level of knowledge."
      ],
      "image": "",
      "hashtags": ["react"]
    },
    {
      "title": "Kodiraonica",
      "subtitle": "2022 - Self Employed - Next.js",
      "href": "kodiraonica",
      "stack": "react",
      "link": "https://kodiraonica.dev/",
      "description": "A landing page built with tailwind and next.js",
      "roleTitle": "Next.js developer",
      "role": [
        "My main task was to create impressive landing page that will attract students to sign up for courses."
      ],
      "image": "",
      "hidden": true,
      "hashtags": ["mentoring"]
    },
    {
      "title": "Span",
      "subtitle": "2021 - Human - Stencil.js",
      "href": "span",
      "stack": "react",
      "link": "https://www.span.eu/",
      "description": "A landing page built with web components on top of storybook and Stencil.js",
      "roleTitle": "Stencil developer",
      "role": [
        "My main task was to deliver responsive abstract and reusable components. I was turning figma designs into components. Some of the components I built are sliders, footer, navigation."
      ],
      "image": "",
      "hashtags": ["react", "storybook"]
    },
    {
      "hashtags": ["angular", "css"],
      "image": "/opx.png",
      "title": "OPX",
      "subtitle": "2021 - OPX - Angular",
      "description": "An application that connects NGOs and their potential donors. The app is basically a huge dashboard with tons of tables and filtering options.",
      "href": "opx",
      "stack": "angular",
      "link": "https://www.opx.org/",
      "roleTitle": "CSS developer",
      "role": [
        "My main task was to implement user interface into Angular platform using Angular Material and CSS. Expertise included CSS knowledge and Angular templating skills.",
        " I was responsible for implementing Figma designs into the Angular app. Pixel perfection was a requirement I had to meet. I had to know Angular templating basics. I created components that rendered either static or mocked data. The hardest task was coding masonry dashboard. Among tasks were also writing unit tests using Jest."
      ]
    },
    {
      "hashtags": ["angular", "rxjs"],
      "image": "/formunauts.png",
      "title": "Formunauts",
      "subtitle": "2020 - Formunauts - Angular",
      "description": "An application that collects funding for NGOs built with Angular and RxJS.",
      "href": "formunauts",
      "stack": "angular",
      "link": "https://www.formunauts.at/en/",
      "roleTitle": "Angular developer",
      "role": [
        "My task was to set a communication between the app and the RaiseNow API. RaiseNow iframe with form was injected into the template. I then had to send data from the form, as well as the data from the previous step, to the API. If there was an error in the form, it should be displayed to the user. The whole integration had to show states based on the connection status. I do not usually code in Angular, that is why this project had steep learning curve. I was able to quickly pick up core Angular and RxJs concepts.",
        "I also implemented different layout based on the status of internet connection. I learned a lot about service workers which I used here for caching assets."
      ]
    },
    {
      "hashtags": ["react"],
      "image": "/revuto.jpg",
      "title": "Revuto",
      "subtitle": "2019 - Async Labs - React",
      "description": "A React application for managing subscriptions.",
      "href": "revuto",
      "stack": "react",
      "link": "https://revuto.com/",
      "roleTitle": "React developer",
      "role": [
        "I was working closely with backend developers and a designer. My task was to create user interface following designs from designer and to connect components via API provided by backend developers. User authorization was handled with tokens. I loved working on this project because I was able to get my hands on Context API and React hooks <3. I used Context API for flash messages and hooks in the stateful functional components. The cool part in login and signup form was custom made captcha. Originally, additions were much complex, but client wanted simplified captcha. Now user should know how to sum two numbers that are not larger than 10. I also really much enjoyed playing with CSS animations and transitions. The most valuable page to client was referral program page which has animation that I coded from scratch. The tricky part was reversing animation. I learned scss can not count nth children backwards."
      ]
    },
    {
      "hashtags": ["django", "css"],
      "image": "/ci.png",
      "title": "Codeinstitute",
      "subtitle": "2019 - Code Institute - CSS",
      "description": "Code Institute is Dublin based bootcamp that trains students from zero to hero, turning them into real porfessional developers with large scope of skills, in front-end and back-end. Students with diploma from Code Institute are eligible to apply to almost any software developer job.",
      "href": "codeinstitute",
      "stack": "css",
      "link": "https://codeinstitute.net/global/",
      "roleTitle": "CSS developer",
      "role": [
        "The main technologies required for this project were HTML, CSS, Scss and JS and some fundamental knowledge in Django architecture.",
        "I  have been developing content and learning material for students. The content I wrote provided students with up to date knowledge about the mandatory skills needed for web development: HTML, CSS, CSS animations and transitions, responsive web design, JS and Scss. After that, students were given challenges where they could practice on real-life examples. Except for challenges, I created a quiz for each lesson that tested student's knowledge as well. The other task was audio and video material that complements the rest of the content.",
        "The task was to implement plenty of new components into an existing LMS based on Django: quizzes, embedded repl.it, sidebar, course content, header, footer. I coded the interface of every course module. I was provided with the design files. It required CSS and Scss skills. The existing LMS code was slow and messy. I improved it with Scss logic. Now it is much cleaner and faster. I liked working with a designer, he had a really good eye for modern and contemporary design",
        "I have been mentoring (remotely) for several years at Code Institute. The major part of the mentorship sessions is focusing on the code quality of students' projects. I help students to think like professional developers from the very start of their coding career. The content agnosticism, don't repeat yourself, reusability and object orientation are principles that I encourage on every session. I advise my students to stay persistent, committed and curious."
      ],
      "hidden": true
    },
    {
      "hashtags": ["react_native", "react"],
      "hidden": true,
      "title": "Craftstrom",
      "subtitle": "2019 - Punk Rock Dev - React Native",
      "description": "Craftstrom enables users to connect to solar panels at their homes. After the login, users are redirected to the dashboard which renders two graphs that show the amount of generated solar energy in the last week. They can also see the state of the battery.",
      "href": "craftstrom",
      "stack": "React Native",
      "link": "https://play.google.com/store/apps/details?id=com.craftstrom",
      "roleTitle": "React Native developer",
      "role": [
        "The app was built with React Native, customized both for Android and iOS. Graphs were made with dc.js and d3.js. Besides those app uses some cool react-native npm packages like tcomb, animatable, moment.js, axios and plenty others.",
        "My task was to implement user interface with react-native-elements and react-native and to handle user authentication and authorization with ajax calls to the backend api. User's token is stored using AsyncStorage. The app excited me a lot because I was able to get my hands on JS and React Native. It made me really happy that I can prove and test my JS skills!"
      ]
    },
    {
      "hashtags": ["css"],
      "hidden": true,
      "title": "Peaks",
      "subtitle": "2015 - Supersuperstudio - Bootstrap",
      "description": "This is a bootstrap template for web and digital agencies. It is best used for showing portfolio and presenting work in general. Web features, such as preloader, parallax, slideshows, full-screen layout and responsivness, will impress your visitors",
      "href": "peaks",
      "stack": "Bootstrap",
      "link": "https://antonijasimic.bitbucket.io/peaks/",
      "roleTitle": "CSS developer",
      "role": [
        "My task was to implement user interface based on the design provided. The hardest part in development process was customization of parallax. It had to be compatible with swiper.js and also fully responsive. Biggest struggle was author section that has multiple parallax. The three images were not supposed to move at the same time which is not default behaviour of parallax plugin. Also, the text should have shown up on hover. And all of that needed to be responsive."
      ]
    }
  ]
}
